import os

class Config:
    # -------------------------------------------------------------
    API_ID="20402718" #ʏᴏᴜʀ ᴀᴘɪ ɪᴅ
    # -------------------------------------------------------------
    API_HASH="14de703801bf414bcffadfb59ae21fba" #ʏᴏᴜʀ ᴀᴘɪ ʜᴀsʜ ɪᴅ
    # -------------------------------------------------------------
    TOKEN="7514619925:AAH6Z2coQ_7_7A-SnHmouCrlSZq9OzClSgc" #ʏᴏᴜʀ ʙᴏᴛ ᴛᴏᴋᴇɴ
    # -------------------------------------------------------------
    SUDO = list(int(i) for i in os.environ.get("SUDO", "6458155947").split(" "))
    # -------------------------------------------------------------
    BOT_ID="7514619925" #ʏᴏᴜʀ ʙᴏᴛ ɪᴅ ( @MissRose_bot) ʜɪɴᴛ ( /id @Superbot)
    # -------------------------------------------------------------
    BOT_USERNAME="DxBanallBOT" #ʏᴏᴜʀ ʙᴏᴛ ᴜsᴇʀɴᴀᴍᴇ ᴡʜɪᴛᴏᴜᴛ @
    # -------------------------------------------------------------
    BOT_NAME="DxBanallBOT" #ʏᴏᴜʀ ʙᴏᴛ ɴᴀᴍᴇ
    # -------------------------------------------------------------
